dzytko/nixie-ch32v003/src/display.c
#include "display.h"

#include <errno.h>

#include "ch32v003fun.h"

static uint8_t displayed_digit = 0xff;

static const uint8_t digit_to_pin[] = {
    PA1, // 0
    PA2, // 1
    PC0, // 2
    PD0, // 3
    PC3, // 4
    PC4, // 5
    PD4, // 6
    PD5, // 7
    PD6, // 8
    PD7, // 9
};


int display_init(void) {
    RCC->APB2PCENR |=
        RCC_APB2Periph_GPIOA |
        RCC_APB2Periph_GPIOC |
        RCC_APB2Periph_GPIOD;

    for (uint8_t i = 0; i < (uint8_t)sizeof(digit_to_pin); i++) {
            funPinMode(digit_to_pin[i], GPIO_Speed_10MHz | GPIO_CNF_OUT_PP);
    }

    return 0;
}

int display_write(const uint8_t digit) {
    if (digit > 9) {
        return -EINVAL;
    }

    display_clear();

    funDigitalWrite(digit_to_pin[digit], 1);
    displayed_digit = digit;

    return 0;
}

int display_get_displayed_digit(uint8_t *digit) {
    *digit = displayed_digit;
    return 0;
}

int display_clear(void) {
    for (uint8_t i = 0; i < sizeof(digit_to_pin); i++) {
        funDigitalWrite(digit_to_pin[i], 0);
    }

    displayed_digit = 0xff;

    return 0;
}
